/**
  ******************************************************************************
  * @author  Huang.
  * @version V3.0
  * @date    2020-10-18
  * @brief   LED配置H文件
  ******************************************************************************
  * @attention
  *
  ******************************************************************************
  */



#ifndef __DRV_LED_H__
#define __DRV_LED_H__


#include "sys.h"

#define LED0 PBout(5)// PB5
#define LED1 PEout(5)// PE5	

void drv_led_Init(void);//初始化

		 				    
#endif
